# Parameter Type Id Classification Description Property

Source: https://www.revitapidocs.com/2026/f27de11c-66b6-e077-4bd2-1996078cefb1.htm

---

| Parameter Type Id Classification Description Property |
| --- |

"Classification Title"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ClassificationDescription { get; }
```

```
Public Shared ReadOnly Property ClassificationDescription As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ClassificationDescription {
	ForgeTypeId^ get ();
}
```

```
static member ClassificationDescription : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace